#include "fun.h"

void UFO::set(int a, char* b, unsigned int c, unsigned int d) {
	sc = a;
	strcpy(name, b);
	size = c;
	mhz = d;
}

void UFO::get(int& a, char* b, unsigned int& c, unsigned int& d)
{
	a = sc;
	b[0] = '\0';                     //Очистка
	b = new char[strlen(name) + 1];   //Размер
	strcpy(b, name);                  //Копируем
	c = size;
	d = mhz;
}

void UFO::show(void) {

	cout << "|" << setw(4) << sc << "|" << setw(21) << left <<
		name << setw(-21) << "|" << setw(12) << size << "|" << setw(28) << mhz << "|" << endl;

}

void printUP()
{
	cout << "----------------------------------------------------------------------" << endl;
	cout << "|                  Проекты поиска внеземных сигналов                 |" << endl;
	cout << "|--------------------------------------------------------------------|" << endl;
	cout << "|Год |Научный              |Диаметр     |Рабочая частота             |" << endl;
	cout << "|    |руководитель         |антенны (м) |частота (МГц)               |" << endl;
	cout << "|----|---------------------|------------|----------------------------|" << endl;
}

void printDOWN()
{
	cout << "|--------------------------------------------------------------------|" << endl;
	cout << "|Примечание: наблюдались объекты от 2 звезд до нескольких галактик   |" << endl;
	cout << "----------------------------------------------------------------------" << endl;
}